In [1]:
import pandas as pd

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['NY', 'LA', 'Chicago']}
df = pd.DataFrame(data)

In [3]:
df

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

In [5]:
df[['Name', 'Age']] # SELECT Name, Age FROM table

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [7]:
df[df['Age'] > 25] #SELECT * FROM table WHERE Age > 25

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago

In [11]:
df.groupby('City')['Age'].mean() # SELECT City, AVG(age) FROM table GROUP BY City

City
Chicago    35.0
LA         30.0
NY         25.0
Name: Age, dtype: float64

In [12]:
df.sort_values(by='Age', ascending=False) # SELECT * FROM table ORDER BY Age DESC

      Name  Age     City
2  Charlie   35  Chicago
1      Bob   30       LA
0    Alice   25       NY

In [15]:
df1 = pd.DataFrame({'id': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'id': [1, 2, 4], 'City': ['NY', 'LA', 'SF']})

merged_df = pd.merge(df1, df2, on='id', how='inner')  # SELECT * FROM table t1 JOIN table t2 on t1.id = t2.id

In [16]:
merged_df

   id   Name City
0   1  Alice   NY
1   2    Bob   LA

In [17]:
df['City'].drop_duplicates() # SELECT DISTINCT City FROM table;

0         NY
1         LA
2    Chicago
Name: City, dtype: object

In [18]:
df[df['Age'].isna()] # SELECT * FROM table WHERE Age is NULL;

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [19]:
df[df['Age'].notna()] # SELECT * FROM table WHERE Age is NOT NULL;

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

In [20]:
df['Age'].sum()

np.int64(90)

In [21]:
df['Age'].mean()

np.float64(30.0)

In [22]:
df['Age'].max()

np.int64(35)

In [23]:
df['Age'].count() # count of non null values

np.int64(3)

In [26]:
df[df['Age'] > 25]

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago

In [27]:
subquery = df[df['Age'] > 25]
subquery

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago

In [29]:
res = subquery[subquery['City'] == 'LA']
res

  Name  Age City
1  Bob   30   LA

In [30]:
data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', 'Engineering', 'Finance', 'Engineering', 'HR'],
    'Salary': [50000, 80000, 60000, 75000, 52000],
    'JoiningDate': ['2020-01-10', '2019-03-25', '2018-07-18', '2021-09-01', '2020-05-15'],
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Chicago']
}

df = pd.DataFrame(data)

In [31]:
df

   EmployeeID     Name   Department  Salary JoiningDate         City
0         101    Alice           HR   50000  2020-01-10     New York
1         102      Bob  Engineering   80000  2019-03-25  Los Angeles
2         103  Charlie      Finance   60000  2018-07-18      Chicago
3         104    David  Engineering   75000  2021-09-01     New York
4         105      Eva           HR   52000  2020-05-15      Chicago

In [32]:
df['JoiningDate'] = pd.to_datetime(df['JoiningDate'])

In [33]:
df

   EmployeeID     Name   Department  Salary JoiningDate         City
0         101    Alice           HR   50000  2020-01-10     New York
1         102      Bob  Engineering   80000  2019-03-25  Los Angeles
2         103  Charlie      Finance   60000  2018-07-18      Chicago
3         104    David  Engineering   75000  2021-09-01     New York
4         105      Eva           HR   52000  2020-05-15      Chicago

In [34]:
df[df['Department'] == 'HR'][['Name', 'Salary']] # Name and Salary of employees in HR department

    Name  Salary
0  Alice   50000
4    Eva   52000

In [35]:
df[df['Salary'] > 60000] # Find all employees who have a salary greater than $60,000.

   EmployeeID   Name   Department  Salary JoiningDate         City
1         102    Bob  Engineering   80000  2019-03-25  Los Angeles
3         104  David  Engineering   75000  2021-09-01     New York

In [36]:
df.groupby('Department')['Salary'].sum() # List the total salary for each department.

Department
Engineering    155000
Finance         60000
HR             102000
Name: Salary, dtype: int64

In [37]:
df[df['City'] == 'New York']['Salary'].mean() #  Find the average salary of employees working in New York.

np.float64(62500.0)

In [38]:
df.sort_values(by='Salary', ascending=False).head(3) # Sort the DataFrame by Salary in descending order and display the top 3 highest-paid employees.

   EmployeeID     Name   Department  Salary JoiningDate         City
1         102      Bob  Engineering   80000  2019-03-25  Los Angeles
3         104    David  Engineering   75000  2021-09-01     New York
2         103  Charlie      Finance   60000  2018-07-18      Chicago

In [42]:
subdata = df[(df['Department'] == 'HR') | (df['Department'] == 'Engineering')] #  Create a new DataFrame that only contains employees from the HR and Engineering departments who are based in Chicago.
subdata[subdata['City'] == 'Chicago']

   EmployeeID Name Department  Salary JoiningDate     City
4         105  Eva         HR   52000  2020-05-15  Chicago

In [43]:
today = pd.to_datetime('2024-09-09')

In [51]:
today
df['YearsWithCOmpany'] = (today - df['JoiningDate']).dt.days // 365 # Add a new column YearsWithCompany which shows how many years an employee has been with the company.

The .dt accessor in Pandas is used to access date and time-related properties of a Series that contains datetime values. It allows you to extract components like year, month, day, hour, minute, and others from a datetime object stored in a Pandas Series

In [52]:
df

,EmployeeID,Name,Department,Salary,JoiningDate,City,YearsWithCOmpany
0,101,Alice,HR,50000,2020-01-10,New York,4
1,102,Bob,Engineering,80000,2019-03-25,Los Angeles,5
2,103,Charlie,Finance,60000,2018-07-18,Chicago,6
3,104,David,Engineering,75000,2021-09-01,New York,3
4,105,Eva,HR,52000,2020-05-15,Chicago,4

In [53]:
import pandas as pd

# Branches table with branch details
branches_data = {
    'BranchID': [101, 102, 103, 104, 105],
    'BranchName': ['NYC Branch', 'LA Branch', 'Chicago Branch', 'Houston Branch', 'Miami Branch'],
    'OpeningDate': ['2015-04-15', '2016-07-20', '2017-03-10', '2018-09-12', '2019-01-05'],
    'Revenue2023': [5000000, 7500000, 6200000, 5400000, 4700000],
    'Region': ['East', 'West', 'Central', 'South', 'South']
}

branches_df = pd.DataFrame(branches_data)
branches_df['OpeningDate'] = pd.to_datetime(branches_df['OpeningDate'])

In [54]:
branches_df

   BranchID      BranchName OpeningDate  Revenue2023   Region
0       101      NYC Branch  2015-04-15      5000000     East
1       102       LA Branch  2016-07-20      7500000     West
2       103  Chicago Branch  2017-03-10      6200000  Central
3       104  Houston Branch  2018-09-12      5400000    South
4       105    Miami Branch  2019-01-05      4700000    South

In [55]:
# Audits table with audit details
audits_data = {
    'AuditID': [201, 202, 203, 204, 205],
    'BranchID': [101, 102, 103, 104, 105],
    'AuditDate': ['2023-12-01', '2023-11-15', '2023-12-10', '2023-12-05', '2023-12-08'],
    'AuditScore': [95, 88, 92, 90, 85]
}

audits_df = pd.DataFrame(audits_data)
audits_df['AuditDate'] = pd.to_datetime(audits_df['AuditDate'])

In [56]:
audits_df

   AuditID  BranchID  AuditDate  AuditScore
0      201       101 2023-12-01          95
1      202       102 2023-11-15          88
2      203       103 2023-12-10          92
3      204       104 2023-12-05          90
4      205       105 2023-12-08          85

In [57]:
# Managers table with regional managers for each region
managers_data = {
    'ManagerID': [301, 302, 303, 304],
    'ManagerName': ['John Doe', 'Jane Smith', 'Michael Brown', 'Emily Davis'],
    'Region': ['East', 'West', 'Central', 'South']
}

managers_df = pd.DataFrame(managers_data)

In [58]:
managers_df

   ManagerID    ManagerName   Region
0        301       John Doe     East
1        302     Jane Smith     West
2        303  Michael Brown  Central
3        304    Emily Davis    South

In [61]:
df1 = audits_df[audits_df['AuditDate'].dt.year == 2023] # Find all branches that have been audited in December 2023.
final = branches_df.merge(df1, left_on='BranchID', right_on='BranchID', how='inner')

In [63]:
final

,BranchID,BranchName,OpeningDate,Revenue2023,Region,AuditID,AuditDate,AuditScore
0,101,NYC Branch,2015-04-15,5000000,East,201,2023-12-01,95
1,102,LA Branch,2016-07-20,7500000,West,202,2023-11-15,88
2,103,Chicago Branch,2017-03-10,6200000,Central,203,2023-12-10,92
3,104,Houston Branch,2018-09-12,5400000,South,204,2023-12-05,90
4,105,Miami Branch,2019-01-05,4700000,South,205,2023-12-08,85

In [64]:
branches_df.columns

Index(['BranchID', 'BranchName', 'OpeningDate', 'Revenue2023', 'Region'], dtype='object')

In [65]:
managers_df.columns

Index(['ManagerID', 'ManagerName', 'Region'], dtype='object')

In [69]:
final2 = managers_df.merge(branches_df, left_on='Region', right_on='Region', how='inner')[['ManagerName', 'BranchName', 'Revenue2023']] # List the names of managers and their corresponding branches with the revenue.

In [70]:
final2

     ManagerName      BranchName  Revenue2023
0       John Doe      NYC Branch      5000000
1     Jane Smith       LA Branch      7500000
2  Michael Brown  Chicago Branch      6200000
3    Emily Davis  Houston Branch      5400000
4    Emily Davis    Miami Branch      4700000

In [71]:
audits_df

   AuditID  BranchID  AuditDate  AuditScore
0      201       101 2023-12-01          95
1      202       102 2023-11-15          88
2      203       103 2023-12-10          92
3      204       104 2023-12-05          90
4      205       105 2023-12-08          85

In [72]:
final3 = branches_df.merge(audits_df, left_on='BranchID', right_on='BranchID', how='inner') # Find branches that have had audits with a score lower than 90, along with the audit dates.
final3 = final3[final3['AuditScore'] < 90][['BranchName', 'AuditDate']]
final3

     BranchName  AuditDate
1     LA Branch 2023-11-15
4  Miami Branch 2023-12-08

In [73]:
audits_df.columns

Index(['AuditID', 'BranchID', 'AuditDate', 'AuditScore'], dtype='object')

In [74]:
audits_branch = branches_df.merge(audits_df, left_on='BranchID', right_on='BranchID', how='inner') # Calculate the average audit score for each region and list the regions with their managers.
final4 = pd.merge(audits_branch, managers_df, on='Region')

In [75]:
final4

,BranchID,BranchName,OpeningDate,Revenue2023,Region,AuditID,AuditDate,AuditScore,ManagerID,ManagerName
0,101,NYC Branch,2015-04-15,5000000,East,201,2023-12-01,95,301,John Doe
1,102,LA Branch,2016-07-20,7500000,West,202,2023-11-15,88,302,Jane Smith
2,103,Chicago Branch,2017-03-10,6200000,Central,203,2023-12-10,92,303,Michael Brown
3,104,Houston Branch,2018-09-12,5400000,South,204,2023-12-05,90,304,Emily Davis
4,105,Miami Branch,2019-01-05,4700000,South,205,2023-12-08,85,304,Emily Davis

In [77]:
final4 = final4.groupby('Region')['AuditScore'].mean()

In [78]:
res = pd.merge(final4, managers_df, on='Region')

In [79]:
res

    Region  AuditScore  ManagerID    ManagerName
0  Central        92.0        303  Michael Brown
1     East        95.0        301       John Doe
2    South        87.5        304    Emily Davis
3     West        88.0        302     Jane Smith